# IsCurrentEntityValid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropData..::..IsCurrentEntityValid Property
DuctFittingAndAccessoryPressureDropData Class See Also
---
True if the current settings stored in the entity is valid.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsCurrentEntityValid { get; set; }
```

Visual Basic
---
```text
Public Property IsCurrentEntityValid As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsCurrentEntityValid {
	bool get ();
	void set (bool value);
}
```

# See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace